///////////////  RECURSION //////////////

//
/* 1. Вычислите факториал числа
Напишите программу на JavaScript для вычисления факториала числа.

В математике факториал неотрицательного целого числа n, обозначаемого n!, является произведением всех положительных целых чисел, меньших или равных n. Например, 5! = 5 x 4 x 3 x 2 x 1 = 120 */

/* function fact(n) {
   if (n === 0) {
      return 1;
   }
   return n * fact(n - 1)
}
document.writeln(fact(5)); */

//
/* 2. Найдите наибольший общий делитель двух положительных чисел
Напишите программу на JavaScript, чтобы найти наибольший общий делитель (НОД) двух положительных чисел. */

/* function NOD(a, b) {
   if (!b) {
      return a;
   }
   return NOD(b, a % b);
}
document.writeln(NOD(96, 140)); */

//
/* 3. Получите целые числа в диапазоне
Напишите программу на JavaScript, чтобы получить целые числа в диапазоне (x, y). */

/* function numArr(a, b) {
   return numArr
}
document.writeln(numArr(10, 18));
//Пример: диапазон (10, 18)
//Ожидаемый результат: [11,12,13,14,15,16,17] */